Revit.Elements.Views.StructuralPlanView
A Revit ViewPlan

Revit.Elements.Views.StructuralPlanView.#ctor(Autodesk.Revit.DB.ViewPlan)
Private constructor

Revit.Elements.Views.StructuralPlanView.#ctor(Autodesk.Revit.DB.Level)
Private constructor

Revit.Elements.Views.StructuralPlanView.InitStructuralPlanView(Autodesk.Revit.DB.ViewPlan)
Initialize a StructuralPlanView element

Revit.Elements.Views.StructuralPlanView.InitStructuralPlanView(Autodesk.Revit.DB.Level)
Initialize a StructuralPlanView element

Revit.Elements.Views.StructuralPlanView.ByLevel(Revit.Elements.Level)
Create a Structural Plan View at the given Level.
level: The Level on which the StructuralPlanView is based.
Returns: A StructuralPlanView if successful.

Revit.Elements.Views.StructuralPlanView.FromExisting(Autodesk.Revit.DB.ViewPlan,System.Boolean)
Create from existing Element
plan:
isRevitOwned:
Returns: